/*
 THW真的真的太帅了!!!
几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几几几几几几几几扮屁屁仄鰻鰻鱈卍鰻姑几仄几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几几几几几几几拗鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻攣几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几几几几几吃鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻什仄几几几几几几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几几几卍几鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻呻仇仇几几几几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几几卍鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻懃仄几几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几拗鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻姜几几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几牝鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几呻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻攣几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几姜鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻姜几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几牝攣鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鱈几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几攣鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻攣吠几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几鱈鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鱈鰻鰻鱈懃鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻牝几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几鰹鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻攣姜呻呻呻呻呻呻拗拗姜攣鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻姜几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几鰻鰻鰻鰻鰻鰻鰻鰻鰻鰹姜拗呻屁呻屁扮扮妓妓屁呻呻姜攣攣鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻什几几几几几几几几几几几几几几几几几几
几几几几几几几几几几卍鰻鰻鰻鰻鰻鰻鰻鰻懃姜拗拗屁妓扮吠吠吠吠吠妓妓姑姑呻姜攣攣鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻吃几几几几几几几几几几几几几几几几几几
几几几几几几几几几几鰻鰻鰻鰻鰻鰻鰻鰻攣姜拗呻屁扮吃吃吃吃吃吃扮吠扮吠吠扮姑拗姜姜攣鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻仄几几几几几几几几几几几几几几几几几
几几几几几几几几几几呻鰻鰻鰻鰻鰻鰻攣拗拗呻姑吠吃牝牝牝牝牝牝牝吃吃吃吠吃妓屁呻拗拗攣鱈鰻鰻鰻鰻鰻鰻鰻鰻攣牝几几几几几几几几几几几几几几几几几
几几几几几几几几几仄鰻鰻鰻鰻鰻鰻攣拗呻呻姑吠牝吃仇仇牝牝牝牝牝牝牝吃牝牝吃扮妓姑屁拗姜懃鰻鰻鰻鰻鰻鰻鰻鰻几几几几几几几几几几几几几几几几几几
几几几几几几几几几拗鰻鰻鰻鰻鰻鱈姜呻屁妓扮吃牝仇卍卍仇仇仇仇牝牝牝牝牝牝牝吃吠扮妓屁拗姜鰻鰻鰻鰻鰻鰻鰻鰻几几几几几几几几几几几几几几几几几几
几几几几几几几几几鰻鰻鰻鰻鰻鰻攣拗屁妓扮吠吃牝仇卍卍卍卍仇仇牝牝牝牝牝牝牝吃吃吠扮妓呻拗攣鰻鰻鰻鰻鰻鰻鰻屁几几几几几几几几几几几几几几几几几
几几几几几几几几几攣鰻鰻鰻鰻鰻姜呻呻妓扮吠吃牝卍卍卍卍卍卍卍仇牝仇牝牝牝牝吃吃吃吠妓屁屁攣鰻鰻鰻鰻鰻鰻鰻呻几几几几几几几几几几几几几几几几几
几几几几几几几几几鰻鰻鰻鰻鰻鰻姜呻屁妓扮吠牝牝卍仄仄仄仄仄卍仇卍卍仇牝牝牝牝吃吃吃妓呻屁呻攣鰻鰻鰻鰻鰻鰻鰻几几几几几几几几几几几几几几几几几
几几几几几几几几几姜鰻鰻鰻鰻鱈呻呻屁妓扮吠吃卍仄仄仄仄仄仄卍卍仇卍仇吠妓姜屁拗姜姜呻屁呻屁呻鰻鰻鰻鰻鰻鰻鰻几几几几几几几几几几几几几几几几几
几几几几几几几几几鰻鰻鰻鰻鰻攣呻呻呻拗姜呻呻卍仄仄仄卍卍卍仇卍仇妓拗鱈鰻鰻鰻鰻鰻鰻懃鰻姜屁呻鱈鰻鰻鰻鰻鰻仄几几几几几几几几几几几几几几几几几
几几几几几几几几几鰻鰻鰻鰻鰻拗呻呻攣鰻鰻鰻鰻鰻鰻攣吃仇卍卍卍牝吃拗攣鰻攣鰹鰻鰻鰻攣鱈鰻鰻呻屁姜鰻鰻鰻鰻鰻鱈几几几几几几几几几几几几几几几几几
几几几几几几几几几仄鰻鰻鰻鰻屁呻鰻鰻鰻鰻鰻鰻鰻鰻鰻攣屁牝仇牝牝吠姑拗姜姜姜姜拗屁呻呻姜姜姜姑呻鰻鰻鰻鰻鰻攣几几几几几几几几几几几几几几几几几
几几几几几几几几几几鰻鰻鰻鰻姑鰹懃攣姜拗姜姜姜姜拗姜呻吠牝牝牝吃吠呻拗姜姜屁姑牝吃妓姑呻呻妓屁鰻鰻鰻鰻鰻姑几几几几几几几几几几几几几几几几几
几几几几几几几几几几几鰻鰻鰻屁拗拗拗呻妓牝扮呻拗姜姜呻屁牝牝牝牝吃屁拗姜屁呻姜妓牝妓扮姑吃牝吠鰻鰻鰻鰻鰻几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几鰻鰻鰻扮屁呻呻姑吠扮拗姑呻姜姜呻呻吃仇牝牝妓呻攣姜鰻鰻鰻鰻姜攣妓吃吃牝吃攣鰻鰻鰻鰻懃几几几几几几几几几几几几几几几几几
几几几几几几几几几几几鰻鰻鰻牝扮屁呻鰻攣鰻鰻鰻鰻拗姜拗呻仇仄卍仇吃呻拗鰻鰻鰻鰻鰻鰻鰻鰹拗扮吃牝拗鰻鰻攣姜攣呻几几几几几几几几几几几几几几几几
几几几几几几几几几几几鰻鰻鰻牝扮呻攣鰻鰻鰻鰻鰻鰻鰻呻姑扮牝仄仄牝牝牝扮鰻鰹鰻鰻鰹姜拗呻扮扮吃牝妓鰻攣攣妓姜鱈几几几几几几几几几几几几几几几几
几几几几几几几几几几几鰻鰻鰻牝妓攣攣鰻鰻鰻攣姜拗呻牝吠吠吃卍仇吠牝牝牝呻拗呻呻吠吠吃牝牝牝吃牝牝鰻鰹拗吠姜鱈几几几几几几几几几几几几几几几几
几几几几几几几几几几呻鰻鰻拗牝吠扮姑妓姑姑呻拗姜吠牝吃吃吃卍卍牝牝牝牝仇姑姜姜屁姑牝牝仇牝牝牝仇鱈鰻姜呻拗鱈几几几几几几几几几几几几几几几几
几几几几几几几几几几姜攣姜牝牝吃吠吠吠姑呻拗拗牝卍吃吃牝吃仄卍仇牝牝牝仄卍卍牝吃吃牝卍牝牝牝牝牝攣鰻懃姜妓姜几几几几几几几几几几几几几几几几
几几几几几几几几几几姜姜攣牝牝牝吃吃牝仇仇卍卍仄卍吠吃吠牝仄卍卍仇牝牝卍卍卍卍卍卍卍卍卍仇牝牝仇呻攣鱈懃妓屁几几几几几几几几几几几几几几几几
几几几几几几几几几几呻呻攣牝牝吃吃牝卍卍仄仄卍牝仇吠吃牝牝卍卍仇卍牝牝卍卍卍仄卍仄仄仄仄卍牝牝卍拗姜攣攣拗几几几几几几几几几几几几几几几几几
几几几几几几几几几几仄扮攣牝牝吃牝牝卍仄仄仄卍仄牝吠吠扮牝仄卍卍卍吠吠牝卍卍卍仄仄仄仄卍卍仇仇卍呻攣攣扮姜几几几几几几几几几几几几几几几几几
几几几几几几几几几几几扮攣吠吃吃牝牝卍仄仄仄仄卍吃妓扮牝仇仄仄仄卍牝吃扮卍卍仄仄仄仄仄卍仇仇仇卍拗扮呻姜吠几几几几几几几几几几几几几几几几几
几几几几几几几几几几几姜吠拗吃吃牝牝卍卍仄仄卍卍牝妓吃牝吃牝牝吃牝卍牝姑仇仄仄仄仄仄卍卍卍仇卍卍呻呻拗屁几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几吃姜妓牝吠牝牝仇卍卍仄卍仇牝扮吃妓拗屁屁呻鰻姑牝呻吠卍卍卍仄仄卍卍卍卍仇仇拗吠吠姑几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几屁姑吃扮牝牝牝仇卍仇卍牝牝拗屁鰻鰻攣姜姜姜攣姜呻扮卍仄仄仄仄卍卍卍卍卍仇几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几扮吠吠扮吃牝牝牝牝卍仇牝牝牝姜鱈攣姜姜呻屁妓吃牝牝卍仄仄仄仄卍卍卍卍卍卍几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几扮呻吠吃吃牝牝牝仇仇仇仇仇牝吃吃吃吃姑吠吠吃牝仇卍仄仄卍卍卍仇卍卍卍仇几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几吠吃吃吠吃牝牝仇牝牝扮吠吃牝牝吠吃牝牝吃吠吃吃牝卍卍卍卍卍卍卍卍牝几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几吃吃吠吃牝吃牝牝扮妓姑吠屁呻呻呻呻呻呻屁姑姑姑呻吃仇卍卍卍卍仇卍牝几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几卍吃吃吠吃吃吃扮拗呻呻姜拗呻拗姜姜呻呻拗拗姜拗姜屁牝卍卍仇仇卍仇仇几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几吠扮吠扮吠妓拗姜鱈鰹懃鱈鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻鰻拗牝卍卍卍卍仇牝什几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几吠吠吠吠吠扮拗鰻鰻鱈姜姜呻呻呻呻呻姑牝妓呻屁妓屁牝仇仇仇仇仇吃几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几仄妓扮扮吠妓屁拗屁拗拗拗呻呻呻呻呻呻呻呻吃牝牝牝牝牝仇牝牝牝牝几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几妓妓屁妓姑妓扮吃扮呻姜攣攣姜姜姜姜呻妓牝牝仇牝牝牝牝牝牝牝几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几几姑姑屁屁姑妓吠吃吃吠呻攣攣攣攣拗扮牝牝牝牝仇仇仇牝牝牝牝几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几几呻屁姑妓扮扮吠吃吃牝牝牝牝牝仇卍仇牝仇仇姜仇牝仇牝牝牝牝几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几几几呻屁妓扮吃吠吃牝牝牝仇仇仇仇仇卍卍卍仇牝牝仇牝牝牝牝姜几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几几几几呻呻姑吠吃吃姑牝仇吃牝牝牝吃牝卍仇仇仇牝牝牝吠扮牝牝几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几几几几几呻呻屁吠吃牝牝吃吃吃牝吃牝牝牝卍仇牝牝吃姑妓吠牝牝几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几几几几几姑姜姜呻吠吠吠妓妓妓吠吠吠吃吃牝牝吃扮呻屁吠牝牝吃几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几几几几几妓拗攣姜拗屁呻姑呻呻呻呻呻屁姑妓扮呻呻屁扮吃吃吃吃几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几几几几几妓妓拗攣攣攣姜姜姜姜姜姜姜姜姜姜姜呻姑吠吠吠吃吃吃几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几几几几几妓妓妓姜攣攣攣攣攣攣攣攣攣姜姜姜屁扮吠吃吠吠吃牝吃几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几几几几几吠扮妓姑拗攣攣懃懃懃攣攣攣姜呻妓吃吃吃吃吃吃吃吃吃几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几几几几几吠扮扮妓姑拗姜攣攣攣攣姜拗呻妓吠吃牝吃吃吃牝牝牝吃几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几几几几几吠吠吠扮妓屁拗攣攣攣姜呻呻姑吠吃吃吃吃牝吃牝牝牝吃几几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几几几几几吠吠吠扮吠妓屁拗姜攣攣姜呻呻姑扮吠吃吃牝牝牝牝牝牝吠几几几几几几几几几几几几几几几几几几几几几几几
几几几几几几几几几几几几几几几几几几几几几扮吠吠吠扮扮妓呻拗姜姜姜拗呻屁扮吠吃吃牝牝牝牝吃牝吠屁几几几几几几几几几几几几几几几几几几几几几几
*/

/***************************************************************
	File name: emperor.cpp
	Author: ljfcnyali
	Create time: 2019年10月24日 星期四 08时29分04秒
***************************************************************/
#include<bits/stdc++.h>

using namespace std;

#define REP(i, a, b) for ( int i = (a), _end_ = (b); i <= _end_; ++ i ) 
#define mem(a) memset ( (a), 0, sizeof ( a ) ) 
#define str(a) strlen ( a ) 
#define int long long
#define pii pair<int, int>
typedef long long LL;

const int maxn = 500010;

int n, m, s, f[maxn], ans;
struct node { int u, v, w; bool operator < (const node &a) const { return w < a.w; } } a[maxn];

inline int find(int x) { return x == f[x] ? x : f[x] = find(f[x]); }

signed main()
{
    freopen("emperor.in", "r", stdin);
    freopen("emperor.out", "w", stdout);
    scanf("%lld%lld%lld", &n, &m, &s);    
    REP(i, 1, m) scanf("%lld%lld%lld", &a[i].u, &a[i].v, &a[i].w);
    sort(a + 1, a + m + 1);
    REP(i, 1, n) f[i] = i;
    int sum = 0;
    REP(i, 1, m)
    {
        int fx = find(a[i].u), fy = find(a[i].v);
        if ( fx == fy ) continue ;
        ans += a[i].w;
        f[fx] = fy; ++ sum; 
        if ( sum == n - 1 ) break ; 
    }
    if ( sum != n - 1 ) puts("-1");
    else printf("%lld\n", ans);
    return 0;
}
